#Scraping information (Sample)

In [151]:
import requests
import sqlite3
import pandas as pd
from bs4 import BeautifulSoup
url = 'https://web.archive.org/web/20230908091635 /https://en.wikipedia.org/wiki/List_of_largest_banks'
db_name = 'Banks.db'
table_name = 'Largest_banks'
csv_path = 'https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMSkillsNetwork-PY0221EN-Coursera/labs/v2/exchange_rate.csv'
df = pd.DataFrame(columns=["Rank","Bank name","Market cap"])
count = 0
html_page = requests.get(url).text
data = BeautifulSoup(html_page, 'html.parser')
tables = data.find_all('tbody')
rows = tables[0].find_all('tr')

for row in rows:
    if count < 50 :
        col = row.find_all('td')
        if len(col)!=0:
            data_dict = {"Rank": int(col[0].contents[0]),
                         "Bank name": col[1].text.strip(),
                         "Market cap": float(col[2].contents[0].strip())} # Convert to float and strip newline
            df1 = pd.DataFrame(data_dict, index=[0])
            df = pd.concat([df,df1], ignore_index=True)
            count+=1
    else:
        break
print(df)

  Rank                                Bank name  Market cap
0    1                           JPMorgan Chase      432.92
1    2                          Bank of America      231.52
2    3  Industrial and Commercial Bank of China      194.56
3    4               Agricultural Bank of China      160.68
4    5                                HDFC Bank      157.91
5    6                              Wells Fargo      155.87
6    7                        HSBC Holdings PLC      148.90
7    8                           Morgan Stanley      140.83
8    9                  China Construction Bank      139.82
9   10                            Bank of China      136.81

/var/folders/v5/_jm3xwg16gn354cp70dxvl180000gn/T/ipykernel_42590/1554874126.py:24: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  df = pd.concat([df,df1], ignore_index=True)

# **Scenario**

As a data engineer, you have to compile the list of the top 10 largest banks in the world ranked by market capitalization in billion USD. Further, you need to transform the data and store it in USD, GBP, EUR, and INR per the exchange rate information made available to you as a CSV file. You should save the processed information table locally in a CSV format and as a database table. Managers from different countries will query the database table to extract the list and note the market capitalization value in their own currency.

Directions:

1. Write a function to extract the tabular information from the given URL under the heading By Market Capitalization, and save it to a data frame.
2. Write a function to transform the data frame by adding columns for Market Capitalization in GBP, EUR, and INR, rounded to 2 decimal places, based on the exchange rate information shared as a CSV file.
3. Write a function to load the transformed data frame to an output CSV file.
4. Write a function to load the transformed data frame to an SQL database server as a table.
5. Write a function to run queries on the database table.
6. Run the following queries on the database table:
- Extract the information for the London office, that is Name and MC_GBP_Billion
- Extract the information for the Berlin office, that is Name and MC_EUR_Billion
- Extract the information for New Delhi office, that is Name and MC_INR_Billion
7. Write a function to log the progress of the code.
8. While executing the data initialization commands and function calls, maintain appropriate log entries.

###Tasks:


Task 1:
Write a function log_progress() to log the progress of the code at different stages in a file code_log.txt. Use the list of log points provided to create log entries as every stage of the code.

Task 2:
Extract the tabular information from the given URL under the heading 'By market capitalization' and save it to a dataframe.
a. Inspect the webpage and identify the position and pattern of the tabular information in the HTML code
b. Write the code for a function extract() to perform the required data extraction.
c. Execute a function call to extract() to verify the output.

Task 3:
Transform the dataframe by adding columns for Market Capitalization in GBP, EUR and INR, rounded to 2 decimal places, based on the exchange rate information shared as a CSV file.
a. Write the code for a function transform() to perform the said task.
b. Execute a function call to transform() and verify the output.

Task 4:
Load the transformed dataframe to an output CSV file. Write a function load_to_csv(), execute a function call and verify the output.

Task 5:
Load the transformed dataframe to an SQL database server as a table. Write a function load_to_db(), execute a function call and verify the output.

Task 6:
Run queries on the database table. Write a function run_queries(), execute a given set of queries and verify the output.

Task 7:
Verify that the log entries have been completed at all stages by checking the contents of the file code_log.txt.

#Libraries

In [152]:
# Import libraries
import requests
from bs4 import BeautifulSoup
import pandas as pd
import numpy as np
from datetime import datetime

# **Scraping Information**

In [153]:
import requests
import sqlite3
import pandas as pd
from bs4 import BeautifulSoup
url = 'https://web.archive.org/web/20230908091635 /https://en.wikipedia.org/wiki/List_of_largest_banks'
db_name = 'Banks.db'
table_name = 'Largest_banks'
csv_path = 'https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMSkillsNetwork-PY0221EN-Coursera/labs/v2/exchange_rate.csv'
df = pd.DataFrame(columns=["Rank","Bank name","Market cap"])
count = 0
html_page = requests.get(url).text
data = BeautifulSoup(html_page, 'html.parser')
tables = data.find_all('tbody')
rows = tables[0].find_all('tr')

for row in rows:
    if count < 50 :
        col = row.find_all('td')
        if len(col)!=0:
            data_dict = {"Rank": int(col[0].contents[0]),
                         "Bank name": col[1].text.strip(),
                         "Market cap": float(col[2].contents[0].strip())} # Convert to float and strip newline
            df1 = pd.DataFrame(data_dict, index=[0])
            df = pd.concat([df,df1], ignore_index=True)
            count+=1
    else:
        break
print(df)

  Rank                                Bank name  Market cap
0    1                           JPMorgan Chase      432.92
1    2                          Bank of America      231.52
2    3  Industrial and Commercial Bank of China      194.56
3    4               Agricultural Bank of China      160.68
4    5                                HDFC Bank      157.91
5    6                              Wells Fargo      155.87
6    7                        HSBC Holdings PLC      148.90
7    8                           Morgan Stanley      140.83
8    9                  China Construction Bank      139.82
9   10                            Bank of China      136.81

/var/folders/v5/_jm3xwg16gn354cp70dxvl180000gn/T/ipykernel_42590/1554874126.py:24: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  df = pd.concat([df,df1], ignore_index=True)

# **Full Code**

In [154]:
# Code for ETL operations on Country-GDP data

# Importing the required libraries


url = 'https://web.archive.org/web/20230908091635 /https://en.wikipedia.org/wiki/List_of_largest_banks'


#Extraction
def extract(url, table_attribs):
    ''' The purpose of this function is to extract the required
    information from the website and save it to a dataframe. The
    function returns the dataframe for further processing. '''
    page = requests.get(url).text
    data = BeautifulSoup(page,'html.parser')
    df = pd.DataFrame(columns=table_attribs)
    tables = data.find_all('tbody')
    rows = tables[0].find_all('tr')
    count = 0 # Initialize count here
    for row in rows:
      if count < 10 :
        col = row.find_all('td')
        if len(col)!=0:
            data_dict = {"Rank": int(col[0].contents[0]),
                         "Bank name": col[1].text.strip(),
                         "Market cap": float(col[2].contents[0].strip())} # Convert to float and strip newline
            df1 = pd.DataFrame(data_dict, index=[0])
            df = pd.concat([df,df1], ignore_index=True)
            count+=1
      else:
          break
    return df # Return the dataframe

In [155]:
df

  Rank                                Bank name  Market cap
0    1                           JPMorgan Chase      432.92
1    2                          Bank of America      231.52
2    3  Industrial and Commercial Bank of China      194.56
3    4               Agricultural Bank of China      160.68
4    5                                HDFC Bank      157.91
5    6                              Wells Fargo      155.87
6    7                        HSBC Holdings PLC      148.90
7    8                           Morgan Stanley      140.83
8    9                  China Construction Bank      139.82
9   10                            Bank of China      136.81

In [156]:
#Transformation
def transform(df):
    df.rename(columns={'Market cap': 'MC_USD_Billion'}, inplace=True)
    exchange_rates = {
        'GBP': 0.79,  # 1 USD = 0.79 GBP
        'EUR': 0.92,  # 1 USD = 0.92 EUR
        'INR': 83.20  # 1 USD = 83.20 INR
    }
    df['MC_GBP_Billion'] = np.round(df['MC_USD_Billion'] * exchange_rates['GBP'], 2)
    df['MC_EUR_Billion'] = np.round(df['MC_USD_Billion'] * exchange_rates['EUR'], 2)
    df['MC_INR_Billion'] = np.round(df['MC_USD_Billion'] * exchange_rates['INR'], 2)

    return df

print(df)

  Rank                                Bank name  Market cap
0    1                           JPMorgan Chase      432.92
1    2                          Bank of America      231.52
2    3  Industrial and Commercial Bank of China      194.56
3    4               Agricultural Bank of China      160.68
4    5                                HDFC Bank      157.91
5    6                              Wells Fargo      155.87
6    7                        HSBC Holdings PLC      148.90
7    8                           Morgan Stanley      140.83
8    9                  China Construction Bank      139.82
9   10                            Bank of China      136.81

In [157]:
#Transformation
def transform(df):
    # Read exchange rate CSV file
    exchange_rate_url = 'https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMSkillsNetwork-PY0221EN-Coursera/labs/v2/exchange_rate.csv'
    exchange_rates = pd.read_csv(exchange_rate_url).set_index('Currency')['Rate'].to_dict()

    # Rename the columns
    df = df.rename(columns={'Market cap': 'MC_USD_Billion', 'Bank name': 'Name'})

    # Add 3 different columns for different currencies
    df['MC_GBP_Billion'] = [np.round(x * exchange_rates['GBP'], 2) for x in df['MC_USD_Billion']]
    df['MC_EUR_Billion'] = [np.round(x * exchange_rates['EUR'], 2) for x in df['MC_USD_Billion']]
    df['MC_INR_Billion'] = [np.round(x * exchange_rates['INR'], 2) for x in df['MC_USD_Billion']]

    return df

In [158]:
transformation_df = transform(df)
transformation_df

,Rank,Name,MC_USD_Billion,MC_GBP_Billion,MC_EUR_Billion,MC_INR_Billion
0,1,JPMorgan Chase,432.92,346.34,402.62,35910.71
1,2,Bank of America,231.52,185.22,215.31,19204.58
2,3,Industrial and Commercial Bank of China,194.56,155.65,180.94,16138.75
3,4,Agricultural Bank of China,160.68,128.54,149.43,13328.41
4,5,HDFC Bank,157.91,126.33,146.86,13098.63
5,6,Wells Fargo,155.87,124.70,144.96,12929.42
6,7,HSBC Holdings PLC,148.90,119.12,138.48,12351.26
7,8,Morgan Stanley,140.83,112.66,130.97,11681.85
8,9,China Construction Bank,139.82,111.86,130.03,11598.07
9,10,Bank of China,136.81,109.45,127.23,11348.39

In [159]:
def load_to_csv(df, csv_path):
    ''' This function saves the final dataframe as a `CSV` file
    in the provided path. Function returns nothing.'''

    df.to_csv(csv_path)

def load_to_db(df, sql_connection, table_name):
    ''' This function saves the final dataframe to as a database table
    with the provided name. Function returns nothing.'''

    df.to_sql(table_name, sql_connection, if_exists='replace', index=False)

def run_query(query_statements, sql_connection):
    ''' This function runs the stated queries on the database table and
    prints the output on the terminal. Function returns nothing. '''
    for query_statement in query_statements:
        print(query_statement)
        query_output = pd.read_sql(query_statement, sql_connection)
        print(query_output)

def log_progress(message):
    ''' This function logs the mentioned message at a given stage of the
    code execution to a log file. Function returns nothing.'''

    timestamp_format = '%Y-%h-%d-%H:%M:%S' # Year-Monthname-Day-Hour-Minute-Second
    now = datetime.now() # get current timestamp
    timestamp = now.strftime(timestamp_format)
    with open("./code_log.txt","a") as f:
        f.write(timestamp + ' : ' + message + '\n')

''' Here, you define the required entities and call the relevant
functions in the correct order to complete the project. Note that this
portion is not inside any function.'''

url = 'https://web.archive.org/web/20230908091635/https://en.wikipedia.org/wiki/List_of_largest_banks'
table_attribs = ["Rank", "Bank name", "Market cap"] # Initial attributes for extraction

db_name = 'Banks.db'
table_name = 'Largest_banks'
csv_path = './Largest_banks_data.csv'

log_progress('Preliminaries complete. Initiating ETL process')

df = extract(url, table_attribs)

log_progress('Data extraction complete. Initiating Transformation process')

df = transform(df)

# The column names should be correct after transform, this line is kept for clarity but may be redundant
df.columns = ['Rank', 'Name', 'MC_USD_Billion', 'MC_GBP_Billion', 'MC_EUR_Billion', 'MC_INR_Billion']


log_progress('Data transformation complete. Initiating loading process')

load_to_csv(df, csv_path)

log_progress('Data saved to CSV file')

sql_connection = sqlite3.connect('Banks.db')

log_progress('SQL Connection initiated.')

load_to_db(df, sql_connection, table_name)

log_progress('Data loaded to Database as table. Running the query')

query_statements = [
    f"SELECT * FROM Largest_banks;",
    f"SELECT AVG(MC_GBP_Billion) FROM Largest_banks;",
    f"SELECT Name FROM Largest_banks LIMIT 5;" # Using 'Name' as the column name
]

run_query(query_statements, sql_connection)

log_progress('Process Complete.')

sql_connection.close()

/var/folders/v5/_jm3xwg16gn354cp70dxvl180000gn/T/ipykernel_42590/713267843.py:28: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  df = pd.concat([df,df1], ignore_index=True)

SELECT * FROM Largest_banks;
   Rank                                     Name  MC_USD_Billion  \
0     1                           JPMorgan Chase          432.92
1     2                          Bank of America          231.52
2     3  Industrial and Commercial Bank of China          194.56
3     4               Agricultural Bank of China          160.68
4     5                                HDFC Bank          157.91
5     6                              Wells Fargo          155.87
6     7                        HSBC Holdings PLC          148.90
7     8                           Morgan Stanley          140.83
8     9                  China Construction Bank          139.82
9    10                            Bank of China          136.81

   MC_GBP_Billion  MC_EUR_Billion  MC_INR_Billion
0          346.34          402.62        35910.71
1          185.22          215.31        19204.58
2          155.65          180.94        16138.75
3          128.54          149.43        13328.41
4          126.33          146.86        13098.63
5          124.70          144.96        12929.42
6          119.12          138.48        12351.26
7          112.66          130.97        11681.85
8          111.86          130.03        11598.07
9          109.45          127.23        11348.39
SELECT AVG(MC_GBP_Billion) FROM Largest_banks;
   AVG(MC_GBP_Billion)
0              151.987
SELECT Name FROM Largest_banks LIMIT 5;
                                      Name
0                           JPMorgan Chase
1                          Bank of America
2  Industrial and Commercial Bank of China
3               Agricultural Bank of China
4                                HDFC Bank

In [160]:
#rm code_log.txt